Repository: 84000/data-translation-memory
Catalog: toh550-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇམ་དཔལ་གྱི་སྔགས་ཡི་གེ་འབྲུ་གཅིག་པའི་ཆོ་ག །ཏདྱ་ཐཱ། ཨོཾ་ཀྵྞཱིཾ། གསང་སྔགས་ཡི་གེ་འབྲུ་གཅིག་པ་འདི་རབ་ཏུ་གསང་བ་སྟེ། དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ། ལས་ཐམས་ཅད་བྱེད་པ།
en: The Noble Procedure for Mañjuśrī's Single-Syllable Mantra tadyathā | oṁ kṣṇīṁ || This single-syllable mantra is exceedingly secret, for it accomplishes every aim and performs every action.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྙིང་པོ། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་སྐོང་བར་མཛད་པ་སྟེ།
en: As the essence of all the tathāgatas, it fulfills all hopes.

source: སོ་ཤིང་ལ་བསྔགས་ནས་བཅངས་ན་སོ་ན་བ་འབྱང་ངོ་།
en: Holding a tooth stick incanted with the mantra will cure toothache.

source: །མིག་ན་བ་ལ་རྒྱམ་ཚྭ་བཏགས་པ་ལ་ལན་བདུན་བསྔགས་ཏེ་མིག་བཀང་ན་མིག་ནད་སེལ་ཏོ།
en: Sea salt incanted seven times with the mantra, when applied to the eyes, will cure eye disease.

source: །མིའི་ཁོང་དུ་མཚོན་གྱི་དུམ་བུ་ལུས་པ་ལ་ཞུན་མར་རྙིང་པ་ལ་ལན་བདུན་ནམ། བརྒྱ་རྩ་བརྒྱད་བསྔགས་ཏེ་བླུད་པའམ། རྨ་ཁར་བསྐུས་ན་མཚོན་གྱི་དུམ་བུ་འབྱུང་བར་འགྱུར་རོ། །ཟས་མ་ཞུ་བ་དང་། སྦོས་ཏེ་གསུད་པ་དང་།
en: If a person has a weapon fragment lodged inside of them, consecrate old and melted butter seven or one hundred and eight times with the mantra and give it to them to drink, or apply it to the wound, and the fragment will be expelled.

source: ཚད་པས་འཁྲུ་བ་ལ་མུ་རང་ཚྭའམ། རྒྱམ་ཚྭའམ། ཡང་ན་ལན་ཚྭ་གཞན་གང་ཡང་རུང་བ་ལ་ལན་བདུན་བསྔགས་ཏེ་ཟོས་ན་ནད་དེ་ལས་གྲོལ་ཏེ་དེ་ཉིད་ཀྱི་ཉིན་པར་སོས་པར་འགྱུར་རོ།
en: Indigestion, swelling, dysentery, and feverish diarrhea will be cured by eating mu rang salt, sea salt, or any other suitable rock salt incanted seven times with the mantra, and recovery will be the very same day.

source: །ཀླད་པ་ན་བ་ལ་བྱ་རོག་གི་སྒྲོ་ལ་ལན་བདུན་བསྔགས་ཏེ་བྱབས་ན་ནད་དེ་སོས་པར་འགྱུར་རོ།
en: Sweeping motions made with a raven’s feather incanted seven times with the mantra will heal illnesses of the brain.

source: །འཇམ་དཔལ་གྱི་ཡི་གེ་འབྲུ་གཅིག་པའི་གཟུངས་རྫོགས་སོ།། །།
en: This concludes the noble “Procedure for Mañjuśrī’s Single-Syllable Mantra.”
